[
  {
    "name": "Allosaurus",
    "description": "Allosaurus was a large bipedal predator. Its skull was light, robust and equipped with dozens of sharp, serrated teeth. It averaged 8.5 meters (28 ft) in length for A. fragilis, with the maximum length estimate being 9.7 meters long. Relative to the large and powerful hindlimbs, its three-fingered forelimbs were small, and the body was balanced by a long and heavily muscled tail. It is classified as an allosaurid, a type of carnosaurian theropod dinosaur.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Allosaurus_Revised.jpg/1920px-Allosaurus_Revised.jpg"
  },
  {
    "name": "Amargasaurus",
    "description": "Amargasaurus was discovered in sedimentary rocks of the La Amarga Formation, which dates back to the Barremian and late Aptian stages of the Early Cretaceous. A herbivore, it shared its environment with at least three other sauropod genera, which might have exploited different food sources in order to reduce competition. Amargasaurus probably fed at mid-height, as shown by the orientation of its inner ear and the articulation of its neck vertebrae, which suggest a habitual position of the snout 80 centimeters (31 inches) above the ground and a maximum height of 2.7 meters (8.9 feet). Within the Sauropoda, Amargasaurus is classified as a member of the family Dicraeosauridae, which differs from other sauropods in showing shorter necks and smaller body sizes.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Amargasaurus_NT_small_%28mirrored%29.jpg"
  },
  {
    "name": "Ankylosaurus",
    "description": "Ankylosaurus is a genus of armored dinosaur. Its fossils have been found in geological formations dating to the very end of the Cretaceous Period, about 68-66 million years ago, in western North America, making it among the last of the non-avian dinosaurs. It was named by Barnum Brown in 1908; it is monotypic, containing only A. magniventris. The generic name means fused lizard, and the specific name means great belly. A handful of specimens have been excavated to date, but a complete skeleton has not been discovered. Though other members of Ankylosauria are represented by more extensive fossil material, Ankylosaurus is often considered the archetypal member of its group, despite having some unusual features.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/3/36/Ankylosaurus_magniventris_reconstruction.png"
  },
  {
    "name": "Anzu wyliei",
    "description": "Anzu wyliei is characterized by a toothless beak, a prominent crest, long arms ending in slender, relatively straight claws, long powerful legs with slender toes, and a relatively short tail. Anzu measured about 3 metres (9.8 ft) to 3.5 metres (11 ft) long, up to 1.5 metres (4.9 ft) tall at the hips and 200 kilograms (440 lb) to 300 kilograms (660 lb) in weight, and was the largest North American oviraptorosaur, though the Mongolian genus Gigantoraptor was larger than Anzu. In 2021, Atkins-Weltman et al. (2021), used two methods to calculate the mass of Anzu. Using volumetric methods, the authors obtained a body mass of 216-280 kg; and using allometric methods, they obtained a result of 159-199 kg. Atkins-Weltman and co-authors, however, commented that volumetric methods are more accurate than allometric methods.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Anzu_wyliei.jpg/1920px-Anzu_wyliei.jpg"
  },
  {
    "name": "Apatosaurus",
    "description": "The cervical vertebrae of Apatosaurus are less elongated and more heavily constructed than those of Diplodocus, a diplodocid like Apatosaurus, and the bones of the leg are much stockier despite being longer, implying that Apatosaurus was a more robust animal. The tail was held above the ground during normal locomotion. Apatosaurus had a single claw on each forelimb and three on each hindlimb. The Apatosaurus skull, long thought to be similar to Camarasaurus, is much more similar to that of Diplodocus. Apatosaurus was a generalized browser that likely held its head elevated. To lighten its vertebrae, Apatosaurus had air sacs that made the bones internally full of holes. Like that of other diplodocids, its tail may have been used as a whip to create loud noises, or, as more recently suggested, as a sensory organ.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Apatosaurus_louisae_by_durbed.jpg/440px-Apatosaurus_louisae_by_durbed.jpg" 
  },
  {
    "name": "Archaeopteryx",
    "description": "Archaeopteryx was roughly the size of a raven, with broad wings that were rounded at the ends and a long tail compared to its body length. It could reach up to 500 millimetres (20 in) in body length, with an estimated mass of 0.8 to 1 kilogram (1.8 to 2.2 lb). Archaeopteryx feathers, although less documented than its other features, were very similar in structure to modern-day bird feathers. Despite the presence of numerous avian features,Archaeopteryx had many non-avian theropod dinosaur characteristics. Unlike modern birds, Archaeopteryx had small teeth, as well as a long bony tail, features which Archaeopteryx shared with other dinosaurs of the time.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/f/f9/Archaeopteryx_NT.jpg"
  },
  {
    "name": "Baryonyx",
    "description": "Baryonyx is estimated to have been between 7.5 and 10 m (25 and 33 ft) long, 2.5 m (8.2 ft) in hip height, and to have weighed between 1.2 and 1.9 t (1.3 and 2.1 short tons; 1.2 and 1.9 long tons). The fact that elements of the skull and vertebral column of the B. walkeri holotype specimen (NHM R9951) do not appear to have co-ossified (fused) suggests that the individual was not fully grown, and the mature animal may have been much larger (as is the case for some other spinosaurids). On the other hand, the specimen's fused sternum indicates that it may have been mature.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Baryonyx_walkeri_restoration.jpg/440px-Baryonyx_walkeri_restoration.jpg"
  },
  {
    "name": "Argentinosaurus",
    "description": "Argentinosaurus is a genus of giant sauropod dinosaur that lived during the Late Cretaceous period in what is now Argentina. Although it is only known from fragmentary remains, Argentinosaurus is one of the largest known land animals of all time, perhaps the largest, with length estimates ranging from 30 to 39.7 metres (100 to 130 ft) and weight estimates from 50 to 100 tonnes (55 to 110 short tons). It was a member of Titanosauria, the dominant group of sauropods during the Cretaceous.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Argentinosaurus_BW.jpg"
  },
  {
    "name": "Barosaurus",
    "description": "Barosaurus was an enormous animal, with some adults measuring about 25-27 meters (82-89 feet) in length and weighing about 12-20 metric tons (13-22 short tons). There are some indications of even larger individuals, such as the enormous vertebra from the BYU 9024 specimen, which is 1.37 meters (4.5 ft) long. Assuming it belongs to Barosaurus, this was an animal that was 48 meters (157 ft) long and around 66 metric tons (73 short tons) in weight making it one of the largest known dinosaurs, with a neck length of at least 15 meters (49 ft) according to Mike Taylor. In 2020 Molina-Perez and Larramendi estimated it to be slightly smaller at 45 meters (148 ft) and 60 metric tons (66 short tons). However, abstracts from SVP indicate an assignment of BYU 9024 under Supersaurus. Barosaurus was differently proportioned than its close relative Diplodocus, with a longer neck and shorter tail, but was about the same length overall. It was longer than Apatosaurus, but its skeleton was less robust.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Barosaurus_lentus1.jpg/1426px-Barosaurus_lentus1.jpg"
  },
  {
    "name": "Brachiosaurus",
    "description": "Brachiosaurus is the namesake genus of the family Brachiosauridae, which includes a handful of other similar sauropods. Most popular depictions of Brachiosaurus are in fact based on Giraffatitan, a genus of brachiosaurid dinosaur from the Tendaguru Formation of Tanzania. Giraffatitan was originally described by German paleontologist Werner Janensch in 1914 as a species of Brachiosaurus, B. brancai, but moved to its own genus in 2009. Three other species of Brachiosaurus have been named based on fossils found in Africa and Europe; two are no longer considered valid, and a third has become a separate genus, Lusotitan.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Brachiosaurus_NT_new.jpg"
  },
  {
    "name": "Compsognathus",
    "description": "Many presentations still describe Compsognathus as chicken-sized dinosaurs because of the size of the German specimen, which is now believed to be a juvenile. Compsognathus longipes is one of the few dinosaur species whose diet is known with certainty: the remains of small, agile lizards are preserved in the bellies of both specimens. Teeth discovered in Portugal may be further fossil remains of the genus.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/c/c4/Compsognathus_BW.jpg"
  },
  {
    "name": "Citipati",
    "description": "Citipati was among the largest oviraptorids; it is estimated to have been around 2.9 m (9.5 ft) in length and to have weighed 75-83 kg (165-183 lb). Its skull was highly pneumatized, short, and had a characteristic crest formed by the premaxilla and nasal bones. Both upper and lower jaws were toothless and developed a horny beak. The tail ended in a pygostyle (the fusion of the last caudal vertebrae), which is known to support large rectrices.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Citipati_osmolskae_Restoration.png/1280px-Citipati_osmolskae_Restoration.png"
  },
  {
    "name": "Coelophysis",
    "description": "Coelophysis was a small, slenderly-built, ground-dwelling, bipedal carnivore that could grow up to 3 m (9.8 ft) long. It is one of the earliest known dinosaur genera. Scattered material representing similar animals has been found worldwide in some Late Triassic and Early Jurassic formations.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Coelophysis_Jeff_Martz.jpg/440px-Coelophysis_Jeff_Martz.jpg"
  },
  {
    "name": "Confuciusornis",
    "description": "Confuciusornis is a genus of basal crow-sized avialan from the Early Cretaceous Period of the Yixian and Jiufotang Formations of China, dating from 125 to 120 million years ago. Like modern birds, Confuciusornis had a toothless beak, but closer and later relatives of modern birds such as Hesperornis and Ichthyornis were toothed, indicating that the loss of teeth occurred convergently in Confuciusornis and living birds. It is the oldest known bird to have a beak. It was named after the Chinese moral philosopher Confucius (551-479 BC). Confuciusornis is one of the most abundant vertebrates found in the Yixian Formation, and several hundred complete specimens have been found.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/b/be/Confuciusornis_plumage_pattern.jpg"
  },
  {
    "name": "Corythosaurus",
    "description": "Corythosaurus is known from many complete specimens, including the nearly complete holotype found by Brown in 1911. The holotype skeleton is only missing the last section of the tail, and part of the forelimbs, but was preserved with impressions of polygonal scales. Corythosaurus is known from many skulls with tall crests. The crests resemble the crests of the cassowary and a Corinthian helmet. The most likely function of the crest is thought to be vocalization. As in a trombone, sound waves would travel through many chambers in the crest, and then get amplified when Corythosaurus exhaled. A Corythosaurus specimen has been preserved with its last meal in its chest cavity. Inside the cavity were remains of conifer needles, seeds, twigs, and fruits: Corythosaurus probably fed on all of these.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Corythosaurus_snorkel.jpg/440px-Corythosaurus_snorkel.jpg"
  },
  {
    "name": "Cryolophosaurus",
    "description": "Cryolophosaurus possessed a distinctive pompadour crest that spanned the head from side to side. Based on evidence from related species and studies of bone texture, it is thought that this bizarre crest was used for intra-species recognition. The brain of Cryolophosaurus was also more primitive than those of other theropods.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Cryolophosaurus_reconstruction_%28flipped%29.jpg"
  },
  {
    "name": "Edmontosaurus",
    "description": "Edmontosaurus included some of the largest hadrosaurid species, measuring up to 12 metres (39 ft) long and weighing around 4.0 metric tons (4.4 short tons). Evidence does exist in the form of two fossilized specimens housed at the Museum of the Rockies for an even greater maximum size of 15 m (49 ft) and weighing 9.07 metric tons (10.00 short tons) for Edmontosaurus annectens. Several well-preserved specimens are known that include not only bones, but in some cases extensive skin impressions and possible gut contents. It is classified as a genus of saurolophine (or hadrosaurine) hadrosaurid, a member of the group of hadrosaurids which lacked large, hollow crests, instead having smaller solid crests or fleshy combs.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/f/f0/Edmontosaurus_BW.jpg"
  },
  {
    "name": "Eoraptor",
    "description": "Eoraptor is a genus of small, lightly built, basal sauropodomorph. One of the earliest-known dinosaurs, it lived approximately 231 to 228 million years ago, during the Late Triassic in Western Gondwana, in the region that is now northwestern Argentina. The type and only species, Eoraptor lunensis, was first described in 1993, and is known from an almost complete and well-preserved skeleton and several fragmentary ones. Eoraptor had multiple tooth shapes, which suggests that it was omnivorous.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/4/49/Eoraptor_NT_small.jpg"
  },
  {
    "name": "Diplodocus",
    "description": "The genus of dinosaurs lived in what is now mid-western North America, at the end of the Jurassic period. It is one of the more common dinosaur fossils found in the middle to upper Morrison Formation, between about 154 and 152 million years ago, during the late Kimmeridgian Age. The Morrison Formation records an environment and time dominated by gigantic sauropod dinosaurs, such as Apatosaurus, Barosaurus, Brachiosaurus, Brontosaurus, and Camarasaurus. Its great size may have been a deterrent to the predators Allosaurus and Ceratosaurus: their remains have been found in the same strata, which suggests that they coexisted with Diplodocus. Diplodocus is among the most easily identifiable dinosaurs, with its typical sauropod shape, long neck and tail, and four sturdy legs. For many years, it was the longest dinosaur known.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Diplodocus_carnegii.jpg/1920px-Diplodocus_carnegii.jpg"
  },
  {
    "name": "Gallimimus",
    "description": "Gallimimus is a genus of theropod dinosaur that lived in what is now Mongolia during the Late Cretaceous period, about seventy million years ago (mya). Several fossils in various stages of growth were discovered by Polish-Mongolian expeditions in the Gobi Desert of Mongolia during the 1960s; a large skeleton discovered in this region was made the holotype specimen of the new genus and species Gallimimus bullatus in 1972. The generic name means chicken mimic, referring to the similarities between its neck vertebrae and those of the Galliformes. The specific name is derived from bulla, a gold capsule worn by Roman youth, in reference to a bulbous structure at the base of the skull of Gallimimus. At the time it was named, the fossils of Gallimimus represented the most complete and best preserved ornithomimid (ostrich dinosaur) material yet discovered, and the genus remains one of the best known members of the group.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Gallimimus_Steveoc86.jpg/440px-Gallimimus_Steveoc86.jpg"
  },
  {
    "name": "Giraffatitan",
    "description": "Giraffatitan (name meaning titanic giraffe) is a genus of sauropod dinosaur that lived during the late Jurassic Period (Kimmeridgian-Tithonian stages) in what is now Lindi Region, Tanzania. It was originally named as an African species of Brachiosaurus (B. brancai), but this has since been moved to its own genus. Giraffatitan was for many decades known as the largest dinosaur but recent discoveries of several larger dinosaurs prove otherwise; giant titanosaurians appear to have surpassed Giraffatitan in terms of sheer mass. Also, the sauropod dinosaur Sauroposeidon is estimated to be taller and possibly heavier than Giraffatitan.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Giraffatitan_DB.jpg"
  },
  {
    "name": "Euoplocephalus",
    "description": "Euoplocephalus was about five and a half meters long and weighed about two and a half tonnes. Its body was low-slung and very flat and wide, standing on four sturdy legs. Its head had a short drooping snout with a horny beak to bite off plants that were digested in the large gut. Like other ankylosaurids, Euoplocephalus was largely covered by bony armor plates, among them rows of large high-ridged oval scutes. The neck was protected by two bone rings. It could also actively defend itself against predators like Gorgosaurus using a heavy club at the end of its tail.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/0/0a/Euoplocephalus_BW.jpg"
  },
  {
    "name": "Isanosaurus",
    "description": "Isanosaurus (meaning Isan [north-eastern Thailand] lizard) was a sauropod dinosaur from Thailand. It was originally dated to approximately 210 million years ago during the Late Triassic (late Norian to Rhaetian stages), which would make it one of the oldest known sauropods. Its age was later considered uncertain, and may be as young as Late Jurassic. The only species is Isanosaurus attavipachi. Though important for the understanding of sauropod origin and early evolution, Isanosaurus is poorly known. Exact relationships to other early sauropods remain unresolved.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Jura_Park_Krasiej%C3%B3w_-_Widok_z_parku_-_panoramio_-_Kazimierz_Mendlik_%2815%29.jpg/500px-Jura_Park_Krasiej%C3%B3w_-_Widok_z_parku_-_panoramio_-_Kazimierz_Mendlik_%2815%29.jpg"
  },
  {
    "name": "Heterodontosaurus",
    "description": "Heterodontosaurus is a genus of heterodontosaurid dinosaur that lived during the Early Jurassic, 200-190 million years ago. Its only known member species, Heterodontosaurus tucki, was named in 1962 based on a skull discovered in South Africa. The genus name means different toothed lizard, in reference to its unusual, heterodont dentition; the specific name honours G. C. Tuck, who supported the discoverers. Further specimens have since been found, including an almost complete skeleton in 1966.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/1/14/Heterodontosaurus_restoration.jpg"
  },
  {
    "name": "Kentrosaurus",
    "description": "Kentrosaurus is a genus of stegosaurid dinosaur from the Late Jurassic in Lindi Region of Tanzania. The type species is K. aethiopicus, named and described by German palaeontologist Edwin Hennig in 1915. Often thought to be a primitive member of the Stegosauria, several recent cladistic analyses find it as more derived than many other stegosaurs, and a close relative of Stegosaurus from the North American Morrison Formation within the Stegosauridae.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/KentrosaurusNV.jpg/1280px-KentrosaurusNV.jpg"
  },
  {
    "name": "Iguanodon",
    "description": "Iguanodon , named in 1825, is a genus of iguanodontian dinosaur. While many species have been classified in the genus Iguanodon, dating from the late Jurassic Period to the early Cretaceous Period of Asia, Europe, and North America, taxonomic revision in the early 21st century has defined Iguanodon to be based on one well-substantiated species: I. bernissartensis, which lived from the late Barremian to the earliest Aptian ages (Early Cretaceous) in Belgium, Germany, England, Spain, and possibly elsewhere in Europe, between about 126 and 122 million years ago. Iguanodon were large, bulky herbivores. Distinctive features include large thumb spikes, which were possibly used for defense against predators, combined with long prehensile fifth fingers able to forage for food.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Hypselospinus_NT.jpg"
  },
  {
    "name": "Microraptor",
    "description": "Microraptor (Greek, μικρός, mīkros: small; Latin, raptor: one who seizes) is a genus of small, four-winged dromaeosaurid dinosaurs. Numerous well-preserved fossil specimens have been recovered from Liaoning, China. They date from the early Cretaceous Jiufotang Formation (Aptian stage), 125 to 120 million years ago. Three species have been named (M. zhaoianus, M. gui, and M. hanqingi), though further study has suggested that all of them represent variation in a single species, which is properly called M. zhaoianus. Cryptovolans, initially described as another four-winged dinosaur, is usually considered to be a synonym of Microraptor.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Microraptor_Restoration.png/440px-Microraptor_Restoration.png"
  },
  {
    "name": "Mamenchisaurus",
    "description": "Mamenchisaurus is a genus of sauropod dinosaur known for their remarkably long necks which made up nearly half the total body length. Numerous species have been assigned to the genus; however, many of these might be questionable. Fossils have been found in the Sichuan Basin and Yunnan Province in China. Several species are from the Upper Shaximiao Formation whose geologic age is uncertain. However, evidence suggests that this be no earlier than the Oxfordian stage of the Late Jurassic. M. sinocanadorum dates to the Oxfordian stage (158.7 - 161.2 mya) and M.anyuensis to the Aptian stage of the Early Cretaceous ~114.4 mya. Most species were medium to large size sauropods 15 to 26 meters (49 to 85 ft) in length. Two as yet undescribed cervical vertebrae, which might belong to M. sinocanadorum, suggest one of the largest dinosaurs known; estimated at 35 metres (115 ft) in length and possibly weighed 60 and 80 tonnes (66 and 88 short tons).",
    "url": "https://upload.wikimedia.org/wikipedia/commons/3/35/Mamenchisaurus_youngi_steveoc_86.jpg"
  },
  {
    "name": "Muttaburrasaurus",
    "description": "Muttaburrasaurus was a genus of herbivorous iguanodontian ornithopod dinosaur, which lived in what is now northeastern Australia sometime between 110 and 103 million years ago during the early Cretaceous period. It has been recovered in some analyses as a member of the iguanodontian clade Rhabdodontomorpha. After Kunbarrasaurus, it is Australia's most completely known dinosaur from skeletal remains. It was named after Muttaburra, the site in Queensland, Australia, where it was found.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/a/a6/Muttaburrasaurus_NT.jpg"
  },
  {
    "name": "Parasaurolophus",
    "description": "Parasaurolophus was a hadrosaurid, part of a diverse family of Cretaceous dinosaurs known for their range of bizarre head adornments which were likely used for communication and better hearing. This genus is known for its large, elaborate cranial crest, which at its largest forms a long curved tube projecting upwards and back from the skull. Charonosaurus from China, which may have been its closest relative, had a similar skull and potentially a similar crest. Visual recognition of both species and sex, acoustic resonance, and thermoregulation have been proposed as functional explanations for the crest. It is one of the rarer hadrosaurids, known from only a handful of good specimens.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/3/3b/Parasaurolophus_walkeri.png"
  },
  {
    "name": "Pachycephalosaurus",
    "description": "Pachycephalosaurus was a bipedal herbivore with an extremely thick skull roof. It possessed long hindlimbs and small forelimbs. Pachycephalosaurus is the largest-known pachycephalosaur. The thick skull domes of Pachycephalosaurus and related genera gave rise to the hypothesis that pachycephalosaurs used their skulls in intra-species combat. This hypothesis has been disputed in recent years.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Pachycephalosaurus_Reconstruction.jpg/1920px-Pachycephalosaurus_Reconstruction.jpg"
  },
  {
    "name": "Plateosaurus",
    "description": "Plateosaurus was a bipedal herbivore with a small skull on a long, flexible neck, sharp but plump plant-crushing teeth, powerful hind limbs, short but muscular arms and grasping hands with large claws on three fingers, possibly used for defence and feeding. Unusually for a dinosaur, Plateosaurus showed strong developmental plasticity: instead of having a fairly uniform adult size, fully grown individuals were between 4.8 and 10 metres (16 and 33 ft) long and weighed between 600 and 4,000 kilograms (1,300 and 8,800 lb). Commonly, the animals lived for at least 12 to 20 years, but the maximum life span is not known.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/7/77/Plateosaurus_engelhardti.png"
  },
  {
    "name": "Sauropelta",
    "description": "Sauropelta is a genus of nodosaurid dinosaur that existed in the Early Cretaceous Period of North America. One species (S. edwardsorum) has been named although others may have existed. Anatomically, Sauropelta is one of the most well-understood nodosaurids, with fossilized remains recovered in the U.S. states of Wyoming, Montana, and possibly Utah. It is also the earliest known genus of nodosaurid; most of its remains are found in a section of the Cloverly Formation dated to 108.5 million years ago.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Sauropelta_reconstruction.png"
  },
  {
    "name": "Scelidosaurus",
    "description": "Scelidosaurus is a genus of herbivorous armoured ornithischian dinosaur from the Jurassic of the British Isles. Scelidosaurus lived during the Early Jurassic Period, during the Sinemurian to Pliensbachian stages around 191 million years ago. This genus and related genera at the time lived on the supercontinent Laurasia. Its fossils have been found in the Charmouth Mudstone Formation near Charmouth in Dorset, England, and these fossils are known for their excellent preservation. Scelidosaurus has been called the earliest complete dinosaur. It is the most completely known dinosaur of the British Isles. Scelidosaurus is currently the only classified dinosaur found in Ireland. Despite this, a modern description only materialised in 2020. After initial finds in the 1850s, comparative anatomist Richard Owen named and described Scelidosaurus in 1859. Only one species, Scelidosaurus harrisonii named by Owen in 1861, is considered valid today, although one other species was proposed in 1996.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Scelidosaurus_harrisonii.png/440px-Scelidosaurus_harrisonii.png"
  },
  {
    "name": "Spinosaurus",
    "description": "Spinosaurus (meaning spine lizard) is a genus of spinosaurid dinosaur that lived in what now is North Africa during the Cenomanian to upper Turonian stages of the Late Cretaceous period, about 99 to 93.5 million years ago. The genus was known first from Egyptian remains discovered in 1912 and described by German palaeontologist Ernst Stromer in 1915. The original remains were destroyed in World War II, but additional material came to light in the early 21st century. It is unclear whether one or two species are represented in the fossils reported in the scientific literature. The best known species is S. aegyptiacus from Egypt, although a potential second species, S. maroccanus, has been recovered from Morocco. The contemporary spinosaurid genus Sigilmassasaurus has also been synonymized by some authors with S. aegyptiacus, though other researchers propose it to be a distinct taxon. Another possible junior synonym is Oxalaia from the Alcântara Formation in Brazil.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Spinosaurus_aegyptiacus_by_PaleoGeek.png/440px-Spinosaurus_aegyptiacus_by_PaleoGeek.png"
  },
  {
    "name": "Stegosaurus",
    "description": "Stegosaurus is a genus of herbivorous, four-legged, armored dinosaur from the Late Jurassic, characterized by the distinctive kite-shaped upright plates along their backs and spikes on their tails. Fossils of the genus have been found in the western United States and in Portugal, where they are found in Kimmeridgian- to early Tithonian-aged strata, dating to between 155 and 145 million years ago. Of the species that have been classified in the upper Morrison Formation of the western US, only three are universally recognized: S. stenops, S. ungulatus and S. sulcatus. The remains of over 80 individual animals of this genus have been found. Stegosaurus would have lived alongside dinosaurs such as Apatosaurus, Diplodocus, Brachiosaurus, Allosaurus, and Ceratosaurus; the latter two may have preyed on it.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/7/70/Stegosaurus_BW.jpg"
  },
  {
    "name": "Struthiomimus",
    "description": "Struthiomimus is a genus of ornithomimid dinosaurs from the late Cretaceous of North America. Ornithomimids were long-legged, bipedal, ostrich-like dinosaurs with toothless beaks. The type species, Struthiomimus altus, is one of the more common small dinosaurs found in Dinosaur Provincial Park; its abundance suggests that these animals were herbivores or omnivores rather than pure carnivores.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Struthiomimus_BW.jpg"
  },
  {
    "name": "Styracosaurus",
    "description": "Styracosaurus is a genus of herbivorous ceratopsian dinosaur from the Cretaceous Period (Campanian stage), about 75.5 to 75 million years ago. It had four to six long parietal spikes extending from its neck frill, a smaller jugal horn on each of its cheeks, and a single horn protruding from its nose, which may have been up to 60 centimeters (2 feet) long and 15 centimeters (6 inches) wide. The function or functions of the horns and frills have been debated for many years.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Styracosaurus_BW.jpg"
  },
  {
    "name": "Therizinosaurus",
    "description": "Therizinosaurus is a genus of very large therizinosaurid that lived in Asia during the Late Cretaceous period in what is now the Nemegt Formation around 70 million years ago. It contains a single species, Therizinosaurus cheloniformis. The first remains of Therizinosaurus were found in 1948 by a Mongolian field expedition at the Gobi Desert and later described by Evgeny Maleev in 1954. The genus is only known from a few bones, including gigantic manual unguals (claw bones), from which it gets its name, and additional findings comprising fore and hindlimb elements that have been discovered during the 1960s-1980s.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Therizinosaurus_Restoration.png/440px-Therizinosaurus_Restoration.png"
  },
  {
    "name": "Triceratops",
    "description": "Triceratops is an extinct genus of herbivorous chasmosaurine ceratopsid dinosaur that first appeared during the late Maastrichtian stage of the Late Cretaceous period, about 68 million years ago in what is now North America. It is one of the last-known non-avian dinosaur genera, and became extinct in the Cretaceous-Paleogene extinction event 66 million years ago",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Triceratops_by_Tom_Patker.png/440px-Triceratops_by_Tom_Patker.png"
  },
  {
    "name": "Troodon",
    "description": "Troodon is a former wastebasket taxon and a potentially dubious genus of relatively small, bird-like dinosaurs known definitively from the Campanian age of the Late Cretaceous period (about 77 mya). It includes at least one species, Troodon formosus, known from Montana. Discovered in October 1855, T. formosus was among the first dinosaurs found in North America, although it was thought to be a lizard until 1877. Several well-known troodontid specimens from the Dinosaur Park Formation in Alberta were once believed to be members of this genus. However, recent analyses in 2017 have found the genus to be undiagnostic and referred some of these specimens to the genus Stenonychosaurus (long believed to be synonymous with Troodon) and others to the genus Latenivenatrix.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/7/72/Troodon_%28cropped%29.jpg"
  },
  {
    "name": "Tyrannosaurus",
    "description": "Tyrannosaurus is a genus of large theropod dinosaur. The species Tyrannosaurus rex (rex meaning king in Latin), often called T. rex or colloquially T-Rex, is one of the best represented theropods. Tyrannosaurus lived throughout what is now western North America, on what was then an island continent known as Laramidia. Tyrannosaurus had a much wider range than other tyrannosaurids. Fossils are found in a variety of rock formations dating to the Maastrichtian age of the Upper Cretaceous period, 68 to 66 million years ago. It was the last known member of the tyrannosaurids and among the last non-avian dinosaurs to exist before the Cretaceous-Paleogene extinction event.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Tyrannosaurus-rex-Profile-steveoc86.png"
  },
  {
    "name": "Velociraptor",
    "description": "Velociraptor is a genus of dromaeosaurid theropod dinosaur that lived approximately 75 to 71 million years ago during the latter part of the Cretaceous Period.[2] Two species are currently recognized, although others have been assigned in the past. The type species is V. mongoliensis; fossils of this species have been discovered in Mongolia. A second species, V. osmolskae, was named in 2008 for skull material from Inner Mongolia, China.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Velociraptor_Restoration.png/440px-Velociraptor_Restoration.png"
  },
  {
    "name": "Utahraptor",
    "description": "Utahraptor (meaning Utah's predator) is a genus of large dromaeosaurid dinosaur that lived in North America during the Early Cretaceous period. It was a heavy-built, ground-dwelling, bipedal carnivore. It contains a single species, Utahraptor ostrommaysi, which is the largest-known member of the family Dromaeosauridae, measuring 23 ft (7.0 m) and weighing 680 kg (1,500 lb).",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Utahraptor_updated.png/1600px-Utahraptor_updated.png"
  }
]