[
  {
    "name": "Tyrannosaurus",
    "description": "Tyrannosaurus is a genus of large theropod dinosaur. The species Tyrannosaurus rex (rex meaning king in Latin), often called T. rex or colloquially T-Rex, is one of the best represented theropods. Tyrannosaurus lived throughout what is now western North America, on what was then an island continent known as Laramidia. Tyrannosaurus had a much wider range than other tyrannosaurids. Fossils are found in a variety of rock formations dating to the Maastrichtian age of the Upper Cretaceous period, 68 to 66 million years ago. It was the last known member of the tyrannosaurids and among the last non-avian dinosaurs to exist before the Cretaceous-Paleogene extinction event.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/0/09/Tyrannosaurus-rex-Profile-steveoc86.png"
  },
  {
    "name": "Velociraptor",
    "description": "Velociraptor is a genus of dromaeosaurid theropod dinosaur that lived approximately 75 to 71 million years ago during the latter part of the Cretaceous Period.[2] Two species are currently recognized, although others have been assigned in the past. The type species is V. mongoliensis; fossils of this species have been discovered in Mongolia. A second species, V. osmolskae, was named in 2008 for skull material from Inner Mongolia, China.",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Velociraptor_Restoration.png/440px-Velociraptor_Restoration.png"
  },
  {
    "name": "Utahraptor",
    "description": "Utahraptor (meaning Utah's predator) is a genus of large dromaeosaurid dinosaur that lived in North America during the Early Cretaceous period. It was a heavy-built, ground-dwelling, bipedal carnivore. It contains a single species, Utahraptor ostrommaysi, which is the largest-known member of the family Dromaeosauridae, measuring 23 ft (7.0 m) and weighing 680 kg (1,500 lb).",
    "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Utahraptor_updated.png/1600px-Utahraptor_updated.png"
  }
]